// https://www.hackerrank.com/challenges/library-fine/problem?isFullScreen=true
/*
Умова:
1. Написати програму, яка обчислює штраф за повернення книги,
якщо вона була повернена пізніше очікуваної дати.
*/

fn libraryFine(d1: i32, m1: i32, y1: i32, d2: i32, m2: i32, y2: i32) -> i32 {
    if y1 < y2 || (y1 == y2 && m1 < m2) || (y1 == y2 && m1 == m2 && d1 <= d2) {
        // Повернено до або в день очікуваного повернення
        0
    } else if y1 == y2 && m1 == m2 {
        // Той самий місяць і рік, прострочення по днях
        15 * (d1 - d2)
    } else if y1 == y2 {
        // Той самий рік, але інший місяць
        500 * (m1 - m2)
    } else {
        // Інший рік
        10000
    }
}