// https://www.hackerrank.com/challenges/utopian-tree/problem?isFullScreen=true
/*
Умова:
Дерево утопії проходить через два цикли росту щороку:

    Кожної весни його висота подвоюється.
    Кожного літа його висота збільшується на 1 метр.

Визначити, якою буде висота дерева після n циклів росту.
*/

fn utopianTree(n: i32) -> i32 {
    let mut height = 1; // Початкова висота дерева

    for cycle in 1..=n {
        if cycle % 2 == 1 {
            // Непарний цикл - весна (подвоєння висоти)
            height *= 2;
        } else {
            // Парний цикл - літо (збільшення висоти на 1)
            height += 1;
        }
    }

    height
}