// Перше завдання
#[test]
fn test1() {
    let v = {
        let mut x = 1;
        x += 2; // Добавляем 2 к x
        x // Возвращаем значение x
    };

    assert_eq!(v, 3);

    println!("Success! 1");
}

// ---------------------------------------------

// Друге завдання
#[test]
fn test2() {
    let x = 3; // Об'являємо змінну x
    let v = x; // Присвоюємо значення x для змінної v

    assert!(v == 3); // Перевіряєм, що v дорівнює 3

    println!("Success! 2"); // Виводимо повідомлення
}

// ---------------------------------------------

// Третє завдання
#[test]
fn test3() {
    let s = sum(1, 2);
    assert_eq!(s, 3);

    println!("Success! 3");
}
fn sum(x: i32, y: i32) -> i32 {
    x + y // Прибираємо крапку з комою, щоб повернути значення
}